# pivot table

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'taxis', 'tips', 'titanic']

In [3]:
flights_data=sns.load_dataset('flights')

In [4]:
flights_data_pivot=flights_data.pivot_table(index='month',columns='year'
                                            ,values='passengers') 
flights_data_pivot.head()

NumExpr defaulting to 4 threads.

year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472

In [5]:
flights_data_pivot.loc[('May',1960)]

472

In [6]:
from matplotlib import pyplot as plt

In [7]:
flights_data_pivot.loc[('Jan',1950)]

115

In [8]:
flights_data.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

# cross tabulation
The	crosstab()	function	is	used	to	plot	cross	tabulation	between	two	columns.	Letâ€™splot	a	cross	tab	matrix between	passenger	class	and	age	columns	for	the	Titanic	dataset.

In [9]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
pd.crosstab(titanic['survived'],titanic['pclass'],margins=True)

pclass      1    2    3  All
survived
0          80   97  372  549
1         136   87  119  342
All       216  184  491  891

In [11]:
a=titanic[(titanic['sex']=='female') & (titanic['survived']==1)]
a['sex'].value_counts()

female    233
Name: sex, dtype: int64

# 	Arithmetic	Operations	with	Where
The	where	clause	from	the	numpy	library	can	be	used	to	perform	arithmetic	operations	on	Pandas	dataframe.	For instance,	in	the	following	script,	the	where	clause	is	used	to	add	5	to	the	rows	in	the	Fare	column,	where passengersâ€™	ages	are	greater	than	20.

In [17]:
np.where(titanic['age']>20,titanic['fare']-10,titanic['fare'])
titanic.fare.apply(lambda x:x-10)

0      -2.7500
1      61.2833
2      -2.0750
3      43.1000
4      -1.9500
        ...
886     3.0000
887    20.0000
888    13.4500
889    20.0000
890    -2.2500
Name: fare, Length: 891, dtype: float64

0      -2.7500
1      61.2833
2      -2.0750
3      43.1000
4      -1.9500
        ...
886     3.0000
887    20.0000
888    13.4500
889    20.0000
890    -2.2500
Name: fare, Length: 891, dtype: float64